clc;
%=== Завдання #1.1 ===
% Синтезування смугового фільтру 2-го порядку 
fs = 200 ;
fc = 20;         
r=0.6; % центральна частота
phi = 2*pi*fc/fs;
b = [1 0 -1] ;                    % чисельник CФ 
a =  [1 -2*r*cos(phi) r^2];	% знаменник


%=== Завдання #1.2 ===
% АЧХ та ФЧХ смугового фільтру 2-го порядку
n=512;
figure()
[h,w]=freqz(b,a,n);
mag=abs(h); phase=angle(h)*180/pi;
subplot(211); plot(w/(2*pi)*fs,mag),grid on
subplot(212), plot(w/(2*pi)*fs,unwrap(phase)),grid on
... введіть позначення осей графіків
...

% Обчислення нулів та полюсів фільтру
nuli = roots(b)
figure(2)
% Карта нулів та полюсів фільтру
zplane(nuli)
% === Завдання #1.4 ===
%y для f1 равен 3.125/sqrt(2)=2.2, для которого x=13.6    
%y для f2 равен 3.125/sqrt(2)=2.2, для которого x=41.8  
f1=13.6;
f2=41.8;
Q=fc/(41.8-13.6)
