clc;
% Синтезування смугового фільтру 2-го порядку 
fs = 200 ;
fc = 20;         
r1=0.6; 
r2=0.7; 
r3=0.9; 
b1 = [1 0 -1] ;                   
a1 =  [1 -2*r1*cos(phi) r^2];	
figure(1);
stepz(b1,a1)
%час перехідного процесу за графіком приблизно 17 мс 

b2 = [1 0 -1] ;                   
a2 =  [1 -2*r2*cos(phi) r^2];	
figure(2);
stepz(b2,a2)
%час перехідного процесу за графіком приблизно 15 мс 

b3 = [1 0 -1] ;                   
a3 =  [1 -2*r3*cos(phi) r^2];	
figure(3);
stepz(b3,a3)
%час перехідного процесу за графіком приблизно 85 мс 