function lab01_main
%=== Дисципліна:Основи обробки біомедичної інформації ===
%--- Лабораторна робота #1 Моделювання дискретних сигналів ---
%
% Використовуйте файли даних: 
% pec1.dat - сигнал ФКГ, ЕКГ та каротидного пульсу
%
% Функції користувача (m-файли), які необхідно розробити:
% pks = pksdetect(х) - знаходження піків в дискретному сигналі
%--------------------------------------------------------------------

clear, clc, close all
disp('Лабораторна робота #1')
disp('Моделювання дискретних сигналів')
disp('Виконав: , група ... ІІДС') 

%=== Завдання #1.1 ===
% Моделювання одиничного імпульсу
N =  ;
n =  ;
x =  ;
y =  ;
 
figure()
subplot( ), stem( )
subplot( ), stem( )

%=== Завдання #1.2 === 
% Моделювання дискретного сигналу
N =  ;
n =  ;
x =  ;
figure()
subplot( ), stem( )
subplot( ), plot( )
subplot( ), stairs( )

%=== Завдання #1.3 ===
% Моделювання дискретної експоненти
n =  ;
x1 =  ;
x2 =  ;
x3 =  ;
x4 =  ;
figure()
subplot( ), stem( )
% продовжіть для сигналів х2, х3, х4


%=== Завдання #1.4 - 1.6 ===
%?1.5
%?1.6
% Знаходження піків сигналу
fs =  ;
t =  ;
x =  ;
pks =  ;


%=== Завдання #2.1 - 2.2 ===
% Моделювання стохастичного сигналу
fs =  ; 
T =  ; 
D =  ;
n =  ;
r =  ;    					% шум
s =  ;        				% сигнал
x =  ;                     % сигнал+шум



%=== Завдання #3.1 ===
% Зчитування відліків біосигналів з файлу pec1.dat 
% та побудова графіків сигналів
pec1 = load();
fs =   ;
fcg = pec1(); 
ecg =  ; 
cps =  ;
t = ;


